Ola 4/ProjectProto/api/load-test.yml
config:
  target: "http://localhost:3001" # Your API base URL
  phases:
    - duration: 60    # Duration of the test in seconds
      arrivalRate: 75 # Number of users per second
      name: "Ramp up to 75 users per second"
scenarios:
  - flow:
      - get:
          url: "/tasks" # Your specific endpoint